Revit 2027 API
Element.Pinned Property
 Identifies if the element has been pinned to prevent changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Pinned { get; set; }
Public Property Pinned As Boolean
	Get
	Set
public:
property bool Pinned {
	bool get ();
	void set (bool value);
}
member Pinned : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Element cannot be pinned or unpinned.
Remarks
 An element which is pinned may not be moved, and warnings will be issued when an attempt is made to delete it.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace